From https://github.com/SMARDY-NCI/ADV
   785a86d..90af24f  exp_rem_rows -> origin/exp_rem_rows
Updating 785a86d..90af24f
Fast-forward
 R/lsdAnalysis.R | 4 ++--
 1 file changed, 2 insertions(+), 2 deletions(-)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

Loading required package: ggplot2
Welcome! Want to learn more? See two factoextra-related books at https://goo.gl/ve3WBa

Attaching package: ‘qqplotr’

The following objects are masked from ‘package:ggplot2’:

    stat_qq_line, StatQqLine

Loading required package: lattice

Attaching package: ‘tidyr’

The following object is masked from ‘package:magrittr’:

    extract


Attaching package: ‘tensorflow’

The following object is masked from ‘package:caret’:

    train

[1] "These variables show null variance. Consider their deletion before the PCA"
[1] "Parameter avge (sd)"
[1] "Rows removal at 2 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 5 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 10 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 20 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 40 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 60 %"
[1] "Parameter avge (sd)"
[1] "Rows removal at 80 %"
[1] "Parameter avge (sd)"
[1] "Parameter avge (sd)"
[1] "Rows removal at 2 %"
[1] "Parameter avge (sd)"
2022-05-26 23:24:46.939911: I tensorflow/core/util/util.cc:159] Experimental oneDNN custom operations are on. To turn them off, set the environment variable `TF_ENABLE_ONEDNN_OPTS=0`.
Loaded Tensorflow version 2.8.0
2022-05-26 23:24:48.838210: W tensorflow/stream_executor/platform/default/dso_loader.cc:64] Could not load dynamic library 'libcuda.so.1'; dlerror: libcuda.so.1: cannot open shared object file: No such file or directory; LD_LIBRARY_PATH: /usr/lib/R/lib:/usr/lib/x86_64-linux-gnu:/usr/lib/jvm/default-java/lib/server
2022-05-26 23:24:48.838247: W tensorflow/stream_executor/cuda/cuda_driver.cc:269] failed call to cuInit: UNKNOWN ERROR (303)
2022-05-26 23:24:48.838270: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:156] kernel driver does not appear to be running on this host (phi): /proc/driver/nvidia/version does not exist
2022-05-26 23:24:48.838539: I tensorflow/core/platform/cpu_feature_guard.cc:151] This TensorFlow binary is optimized with oneAPI Deep Neural Network Library (oneDNN) to use the following CPU instructions in performance-critical operations:  AVX2 FMA
To enable them in other operations, rebuild TensorFlow with the appropriate compiler flags.
Model: "sequential"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2178533.50009/9 [==============================] - ETA: 0s - loss: 2025034.37509/9 [==============================] - 0s 7ms/step - loss: 2025034.3750
1/9 [==>...........................] - ETA: 0s - loss: 2178533.50009/9 [==============================] - ETA: 0s - loss: 2025034.37509/9 [==============================] - 0s 6ms/step - loss: 2025034.3750
Model: "sequential_1"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 84744.91419/9 [==============================] - ETA: 0s - loss: 229641.35949/9 [==============================] - 0s 7ms/step - loss: 229641.3594
1/9 [==>...........................] - ETA: 0s - loss: 84744.91419/9 [==============================] - ETA: 0s - loss: 229641.35949/9 [==============================] - 0s 7ms/step - loss: 229641.3594
Model: "sequential_2"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 312519.06259/9 [==============================] - ETA: 0s - loss: 868668.18759/9 [==============================] - 0s 7ms/step - loss: 868668.1875
1/9 [==>...........................] - ETA: 0s - loss: 312519.06259/9 [==============================] - ETA: 0s - loss: 868668.18759/9 [==============================] - 0s 6ms/step - loss: 868668.1875
Model: "sequential_3"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 167137.31259/9 [==============================] - ETA: 0s - loss: 708436.50009/9 [==============================] - 0s 6ms/step - loss: 708436.5000
1/9 [==>...........................] - ETA: 0s - loss: 167137.31259/9 [==============================] - ETA: 0s - loss: 708436.50009/9 [==============================] - 0s 6ms/step - loss: 708436.5000
Model: "sequential_4"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 99733.87509/9 [==============================] - ETA: 0s - loss: 199169.20319/9 [==============================] - 0s 6ms/step - loss: 199169.2031
1/9 [==>...........................] - ETA: 0s - loss: 99733.87509/9 [==============================] - ETA: 0s - loss: 199169.20319/9 [==============================] - 0s 6ms/step - loss: 199169.2031
Model: "sequential_5"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 189757.68759/9 [==============================] - ETA: 0s - loss: 704621.87509/9 [==============================] - 0s 7ms/step - loss: 704621.8750
1/9 [==>...........................] - ETA: 0s - loss: 189757.68759/9 [==============================] - ETA: 0s - loss: 704621.87509/9 [==============================] - 0s 7ms/step - loss: 704621.8750
Model: "sequential_6"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2315997.50009/9 [==============================] - ETA: 0s - loss: 2584974.75009/9 [==============================] - 0s 6ms/step - loss: 2584974.7500
1/9 [==>...........................] - ETA: 0s - loss: 2315997.50008/9 [=========================>....] - ETA: 0s - loss: 2572896.50009/9 [==============================] - 0s 8ms/step - loss: 2584974.7500
Model: "sequential_7"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2131635.50008/9 [=========================>....] - ETA: 0s - loss: 1653638.62509/9 [==============================] - 0s 8ms/step - loss: 1672113.7500
1/9 [==>...........................] - ETA: 0s - loss: 2131635.50009/9 [==============================] - ETA: 0s - loss: 1672113.75009/9 [==============================] - 0s 7ms/step - loss: 1672113.7500
Model: "sequential_8"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 573254.06259/9 [==============================] - ETA: 0s - loss: 1138200.12509/9 [==============================] - 0s 6ms/step - loss: 1138200.1250
1/9 [==>...........................] - ETA: 0s - loss: 573254.06259/9 [==============================] - ETA: 0s - loss: 1138200.12509/9 [==============================] - 0s 7ms/step - loss: 1138200.1250
Model: "sequential_9"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 78672.35169/9 [==============================] - ETA: 0s - loss: 178809.81259/9 [==============================] - 0s 7ms/step - loss: 178809.8125
1/9 [==>...........................] - ETA: 0s - loss: 78672.35168/9 [=========================>....] - ETA: 0s - loss: 174836.67199/9 [==============================] - 0s 7ms/step - loss: 178809.8125
Model: "sequential_10"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 450878.65629/9 [==============================] - ETA: 0s - loss: 776758.25009/9 [==============================] - 0s 7ms/step - loss: 776758.2500
1/9 [==>...........................] - ETA: 0s - loss: 450878.65629/9 [==============================] - ETA: 0s - loss: 776758.25009/9 [==============================] - 0s 7ms/step - loss: 776758.2500
Model: "sequential_11"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 230208.28129/9 [==============================] - ETA: 0s - loss: 799760.81259/9 [==============================] - 0s 7ms/step - loss: 799760.8125
1/9 [==>...........................] - ETA: 0s - loss: 230208.28129/9 [==============================] - ETA: 0s - loss: 799760.81259/9 [==============================] - 0s 7ms/step - loss: 799760.8125
Model: "sequential_12"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
