From https://github.com/SMARDY-NCI/ADV
   3bc39fe..ec6ffa0  exp_rem_rows -> origin/exp_rem_rows
Updating 3bc39fe..ec6ffa0
Fast-forward
 R/autoenc_opt_layers.R | 6 +++---
 1 file changed, 3 insertions(+), 3 deletions(-)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

Loading required package: ggplot2
Welcome! Want to learn more? See two factoextra-related books at https://goo.gl/ve3WBa

Attaching package: ‘qqplotr’

The following objects are masked from ‘package:ggplot2’:

    stat_qq_line, StatQqLine

Loading required package: lattice

Attaching package: ‘tidyr’

The following object is masked from ‘package:magrittr’:

    extract


Attaching package: ‘tensorflow’

The following object is masked from ‘package:caret’:

    train

[1] "These variables show null variance. Consider their deletion before the PCA"
[1] "Parameter avge (sd)"
 [1] "0.0055 (1e-04)"   "9.7631 (0.0011)"  "-4.1189 (0.0072)" "0.4782 (0.0065)" 
 [5] "0.5993 (0.0031)"  "0.2097 (0.002)"   "0.3217 (0.0098)"  "0.1003 (0.0012)" 
 [9] "0.3234 (0.0247)"  "0.0888 (0.001)"   "0.116 (0.0468)"  
[1] "Parameter avge (sd)"
2022-05-26 22:38:41.754361: I tensorflow/core/util/util.cc:159] Experimental oneDNN custom operations are on. To turn them off, set the environment variable `TF_ENABLE_ONEDNN_OPTS=0`.
Loaded Tensorflow version 2.8.0
2022-05-26 22:38:43.684290: W tensorflow/stream_executor/platform/default/dso_loader.cc:64] Could not load dynamic library 'libcuda.so.1'; dlerror: libcuda.so.1: cannot open shared object file: No such file or directory; LD_LIBRARY_PATH: /usr/lib/R/lib:/usr/lib/x86_64-linux-gnu:/usr/lib/jvm/default-java/lib/server
2022-05-26 22:38:43.684319: W tensorflow/stream_executor/cuda/cuda_driver.cc:269] failed call to cuInit: UNKNOWN ERROR (303)
2022-05-26 22:38:43.684342: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:156] kernel driver does not appear to be running on this host (phi): /proc/driver/nvidia/version does not exist
2022-05-26 22:38:43.684565: I tensorflow/core/platform/cpu_feature_guard.cc:151] This TensorFlow binary is optimized with oneAPI Deep Neural Network Library (oneDNN) to use the following CPU instructions in performance-critical operations:  AVX2 FMA
To enable them in other operations, rebuild TensorFlow with the appropriate compiler flags.
Model: "sequential"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2.0219e-048/9 [=========================>....] - ETA: 0s - loss: 2.8991e-049/9 [==============================] - 0s 7ms/step - loss: 2.9317e-04
1/9 [==>...........................] - ETA: 0s - loss: 2.0219e-049/9 [==============================] - ETA: 0s - loss: 2.9317e-049/9 [==============================] - 0s 7ms/step - loss: 2.9317e-04
Model: "sequential_1"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2.3964e-049/9 [==============================] - ETA: 0s - loss: 3.0719e-049/9 [==============================] - 0s 7ms/step - loss: 3.0719e-04
1/9 [==>...........................] - ETA: 0s - loss: 2.3964e-049/9 [==============================] - ETA: 0s - loss: 3.0719e-049/9 [==============================] - 0s 7ms/step - loss: 3.0719e-04
Model: "sequential_2"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.2777e-049/9 [==============================] - ETA: 0s - loss: 1.9618e-049/9 [==============================] - 0s 7ms/step - loss: 1.9618e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.2777e-049/9 [==============================] - ETA: 0s - loss: 1.9618e-049/9 [==============================] - 0s 7ms/step - loss: 1.9618e-04
Model: "sequential_3"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 9.7885e-059/9 [==============================] - ETA: 0s - loss: 1.4283e-049/9 [==============================] - 0s 7ms/step - loss: 1.4283e-04
1/9 [==>...........................] - ETA: 0s - loss: 9.7885e-059/9 [==============================] - ETA: 0s - loss: 1.4283e-049/9 [==============================] - 0s 7ms/step - loss: 1.4283e-04
Model: "sequential_4"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.0355e-049/9 [==============================] - 0s 6ms/step - loss: 1.6615e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.0355e-048/9 [=========================>....] - ETA: 0s - loss: 1.6449e-049/9 [==============================] - 0s 7ms/step - loss: 1.6615e-04
Model: "sequential_5"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.6161e-049/9 [==============================] - ETA: 0s - loss: 2.8989e-049/9 [==============================] - 0s 7ms/step - loss: 2.8989e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.6161e-049/9 [==============================] - ETA: 0s - loss: 2.8989e-049/9 [==============================] - 0s 6ms/step - loss: 2.8989e-04
Model: "sequential_6"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 4.2971e-049/9 [==============================] - ETA: 0s - loss: 7.8304e-049/9 [==============================] - 0s 7ms/step - loss: 7.8304e-04
1/9 [==>...........................] - ETA: 0s - loss: 4.2971e-049/9 [==============================] - ETA: 0s - loss: 7.8304e-049/9 [==============================] - 0s 7ms/step - loss: 7.8304e-04
Model: "sequential_7"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 3.7913e-049/9 [==============================] - ETA: 0s - loss: 6.8747e-049/9 [==============================] - 0s 7ms/step - loss: 6.8747e-04
1/9 [==>...........................] - ETA: 0s - loss: 3.7913e-048/9 [=========================>....] - ETA: 0s - loss: 6.8224e-049/9 [==============================] - 0s 7ms/step - loss: 6.8747e-04
Model: "sequential_8"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.5765e-049/9 [==============================] - ETA: 0s - loss: 2.1348e-049/9 [==============================] - 0s 7ms/step - loss: 2.1348e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.5765e-049/9 [==============================] - ETA: 0s - loss: 2.1348e-049/9 [==============================] - 0s 7ms/step - loss: 2.1348e-04
Model: "sequential_9"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 0.00129/9 [==============================] - ETA: 0s - loss: 0.00119/9 [==============================] - 0s 7ms/step - loss: 0.0011
1/9 [==>...........................] - ETA: 0s - loss: 0.00129/9 [==============================] - ETA: 0s - loss: 0.00119/9 [==============================] - 0s 7ms/step - loss: 0.0011
Model: "sequential_10"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 0.00109/9 [==============================] - ETA: 0s - loss: 8.8179e-049/9 [==============================] - 0s 7ms/step - loss: 8.8179e-04
1/9 [==>...........................] - ETA: 0s - loss: 0.00109/9 [==============================] - ETA: 0s - loss: 8.8179e-049/9 [==============================] - 0s 7ms/step - loss: 8.8179e-04
Model: "sequential_11"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 9.8974e-049/9 [==============================] - ETA: 0s - loss: 8.7563e-049/9 [==============================] - 0s 7ms/step - loss: 8.7563e-04
1/9 [==>...........................] - ETA: 0s - loss: 9.8974e-049/9 [==============================] - ETA: 0s - loss: 8.7563e-049/9 [==============================] - 0s 6ms/step - loss: 8.7563e-04
Model: "sequential_12"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 0.00128/9 [=========================>....] - ETA: 0s - loss: 0.00129/9 [==============================] - 0s 7ms/step - loss: 0.0011
1/9 [==>...........................] - ETA: 0s - loss: 0.00129/9 [==============================] - ETA: 0s - loss: 0.00119/9 [==============================] - 0s 7ms/step - loss: 0.0011
Model: "sequential_13"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.9049e-049/9 [==============================] - ETA: 0s - loss: 2.4253e-049/9 [==============================] - 0s 7ms/step - loss: 2.4253e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.9049e-049/9 [==============================] - ETA: 0s - loss: 2.4253e-049/9 [==============================] - 0s 7ms/step - loss: 2.4253e-04
Model: "sequential_14"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.4272e-049/9 [==============================] - ETA: 0s - loss: 1.8029e-049/9 [==============================] - 0s 7ms/step - loss: 1.8029e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.4272e-049/9 [==============================] - ETA: 0s - loss: 1.8029e-049/9 [==============================] - 0s 7ms/step - loss: 1.8029e-04
Model: "sequential_15"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2.2076e-049/9 [==============================] - ETA: 0s - loss: 3.1314e-049/9 [==============================] - 0s 7ms/step - loss: 3.1314e-04
1/9 [==>...........................] - ETA: 0s - loss: 2.2076e-049/9 [==============================] - ETA: 0s - loss: 3.1314e-049/9 [==============================] - 0s 6ms/step - loss: 3.1314e-04
Model: "sequential_16"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2.6944e-049/9 [==============================] - ETA: 0s - loss: 3.8630e-049/9 [==============================] - 0s 6ms/step - loss: 3.8630e-04
1/9 [==>...........................] - ETA: 0s - loss: 2.6944e-049/9 [==============================] - ETA: 0s - loss: 3.8630e-049/9 [==============================] - 0s 7ms/step - loss: 3.8630e-04
Model: "sequential_17"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 1.5529e-049/9 [==============================] - ETA: 0s - loss: 2.0748e-049/9 [==============================] - 0s 7ms/step - loss: 2.0748e-04
1/9 [==>...........................] - ETA: 0s - loss: 1.5529e-049/9 [==============================] - ETA: 0s - loss: 2.0748e-049/9 [==============================] - 0s 6ms/step - loss: 2.0748e-04
Model: "sequential_18"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 0.00129/9 [==============================] - ETA: 0s - loss: 0.00129/9 [==============================] - 0s 7ms/step - loss: 0.0012
1/9 [==>...........................] - ETA: 0s - loss: 0.00129/9 [==============================] - ETA: 0s - loss: 0.00129/9 [==============================] - 0s 7ms/step - loss: 0.0012
Model: "sequential_19"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 30)                      930         
                                                                                
 hidden_in_1 (Dense)                (None, 16)                      496         
                                                                                
 latent (Dense)                     (None, 4)                       68          
                                                                                
 hidded_out_1 (Dense)               (None, 16)                      80          
                                                                                
 output (Dense)                     (None, 30)                      510         
                                                                                
================================================================================
Total params: 2,084
Trainable params: 2,084
Non-trainable params: 0
________________________________________________________________________________
1/9 [==>...........................] - ETA: 0s - loss: 2.1947e-049/9 [==============================] - ETA: 0s - loss: 3.6125e-049/9 [==============================] - 0s 7ms/step - loss: 3.6125e-04
1/9 [==>...........................] - ETA: 0s - loss: 2.1947e-049/9 [==============================] - ETA: 0s - loss: 3.6125e-049/9 [==============================] - 0s 7ms/step - loss: 3.6125e-04
git add *.RData
git commit -m "Updated results"
[exp_rem_rows f9804b3] Updated results
 Committer: Alba Gonzalez-Cebrian <alba@phi.cloudenci.ie>
Your name and email address were configured automatically based
on your username and hostname. Please check that they are accurate.
You can suppress this message by setting them explicitly:

    git config --global user.name "Your Name"
    git config --global user.email you@example.com

After doing this, you may fix the identity used for this commit with:

    git commit --amend --reset-author

 1 file changed, 0 insertions(+), 0 deletions(-)
 rewrite RowsPctge_models.RData (100%)
git pull
Already up to date.
git push
To https://github.com/SMARDY-NCI/ADV.git
   ec6ffa0..f9804b3  exp_rem_rows -> exp_rem_rows
