Already up to date.

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

Loading required package: ggplot2
Welcome! Want to learn more? See two factoextra-related books at https://goo.gl/ve3WBa

Attaching package: ‘qqplotr’

The following objects are masked from ‘package:ggplot2’:

    stat_qq_line, StatQqLine

Loading required package: lattice

Attaching package: ‘tidyr’

The following object is masked from ‘package:magrittr’:

    extract


Attaching package: ‘tensorflow’

The following object is masked from ‘package:caret’:

    train

[1] "These variables show null variance. Consider their deletion before the PCA"
[1] "N layers at  13"
2022-05-27 15:02:47.739107: I tensorflow/core/util/util.cc:159] Experimental oneDNN custom operations are on. To turn them off, set the environment variable `TF_ENABLE_ONEDNN_OPTS=0`.
Loaded Tensorflow version 2.8.0
2022-05-27 15:02:49.859080: W tensorflow/stream_executor/platform/default/dso_loader.cc:64] Could not load dynamic library 'libcuda.so.1'; dlerror: libcuda.so.1: cannot open shared object file: No such file or directory; LD_LIBRARY_PATH: /usr/lib/R/lib:/usr/lib/x86_64-linux-gnu:/usr/lib/jvm/default-java/lib/server
2022-05-27 15:02:49.859105: W tensorflow/stream_executor/cuda/cuda_driver.cc:269] failed call to cuInit: UNKNOWN ERROR (303)
2022-05-27 15:02:49.859129: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:156] kernel driver does not appear to be running on this host (phi): /proc/driver/nvidia/version does not exist
2022-05-27 15:02:49.859376: I tensorflow/core/platform/cpu_feature_guard.cc:151] This TensorFlow binary is optimized with oneAPI Deep Neural Network Library (oneDNN) to use the following CPU instructions in performance-critical operations:  AVX2 FMA
To enable them in other operations, rebuild TensorFlow with the appropriate compiler flags.
Model: "sequential"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 13)                      182         
                                                                                
 latent (Dense)                     (None, 2)                       28          
                                                                                
 output (Dense)                     (None, 13)                      39          
                                                                                
================================================================================
Total params: 249
Trainable params: 249
Non-trainable params: 0
________________________________________________________________________________
 1/22 [>.............................] - ETA: 0s - loss: 103648.296910/22 [============>.................] - ETA: 0s - loss: 119132.078119/22 [========================>.....] - ETA: 0s - loss: 119336.984422/22 [==============================] - 0s 6ms/step - loss: 116227.1250
1/3 [=========>....................] - ETA: 0s - loss: 109680.70313/3 [==============================] - 0s 6ms/step - loss: 116232.2969
1/2 [==============>...............] - ETA: 0s - loss: 196145.71882/2 [==============================] - 0s 8ms/step - loss: 192819.4531
 1/22 [>.............................] - ETA: 0s - loss: 95662.609410/22 [============>.................] - ETA: 0s - loss: 117847.875019/22 [========================>.....] - ETA: 0s - loss: 118565.195322/22 [==============================] - 0s 6ms/step - loss: 115939.1484
1/3 [=========>....................] - ETA: 0s - loss: 127383.17193/3 [==============================] - 0s 5ms/step - loss: 118651.4219
1/2 [==============>...............] - ETA: 0s - loss: 196678.87502/2 [==============================] - 0s 8ms/step - loss: 193378.6719
 1/22 [>.............................] - ETA: 0s - loss: 104407.640611/22 [==============>...............] - ETA: 0s - loss: 119665.226621/22 [===========================>..] - ETA: 0s - loss: 115818.640622/22 [==============================] - 0s 5ms/step - loss: 117303.1562
1/3 [=========>....................] - ETA: 0s - loss: 105446.28123/3 [==============================] - 0s 6ms/step - loss: 105833.0000
1/2 [==============>...............] - ETA: 0s - loss: 196011.03122/2 [==============================] - 0s 8ms/step - loss: 192679.5156
 1/22 [>.............................] - ETA: 0s - loss: 98912.703110/22 [============>.................] - ETA: 0s - loss: 121201.062519/22 [========================>.....] - ETA: 0s - loss: 121148.093822/22 [==============================] - 0s 6ms/step - loss: 118207.0625
1/3 [=========>....................] - ETA: 0s - loss: 101269.53123/3 [==============================] - 0s 6ms/step - loss: 97809.7969
1/2 [==============>...............] - ETA: 0s - loss: 195909.18752/2 [==============================] - 0s 7ms/step - loss: 192578.7812
 1/22 [>.............................] - ETA: 0s - loss: 105280.687511/22 [==============>...............] - ETA: 0s - loss: 115476.976621/22 [===========================>..] - ETA: 0s - loss: 114355.867222/22 [==============================] - 0s 5ms/step - loss: 114985.8359
1/3 [=========>....................] - ETA: 0s - loss: 142408.09383/3 [==============================] - 0s 6ms/step - loss: 126469.6953
1/2 [==============>...............] - ETA: 0s - loss: 195596.78122/2 [==============================] - 0s 6ms/step - loss: 192264.1406
 1/22 [>.............................] - ETA: 0s - loss: 95894.906210/22 [============>.................] - ETA: 0s - loss: 117492.859420/22 [==========================>...] - ETA: 0s - loss: 115491.703122/22 [==============================] - 0s 6ms/step - loss: 114495.4062
1/3 [=========>....................] - ETA: 0s - loss: 132009.56253/3 [==============================] - 0s 6ms/step - loss: 130988.0234
1/2 [==============>...............] - ETA: 0s - loss: 197600.53122/2 [==============================] - 0s 6ms/step - loss: 194409.6250
 1/22 [>.............................] - ETA: 0s - loss: 97907.843810/22 [============>.................] - ETA: 0s - loss: 118220.921920/22 [==========================>...] - ETA: 0s - loss: 117662.351622/22 [==============================] - 0s 6ms/step - loss: 116210.9531
1/3 [=========>....................] - ETA: 0s - loss: 130468.55473/3 [==============================] - 0s 6ms/step - loss: 115007.4453
1/2 [==============>...............] - ETA: 0s - loss: 196060.56252/2 [==============================] - 0s 6ms/step - loss: 192754.3594
 1/22 [>.............................] - ETA: 0s - loss: 100508.640610/22 [============>.................] - ETA: 0s - loss: 118881.835919/22 [========================>.....] - ETA: 0s - loss: 119411.476622/22 [==============================] - 0s 6ms/step - loss: 115920.7109
1/3 [=========>....................] - ETA: 0s - loss: 117556.00783/3 [==============================] - 0s 6ms/step - loss: 117463.0391
1/2 [==============>...............] - ETA: 0s - loss: 196417.40622/2 [==============================] - 0s 6ms/step - loss: 193140.9062
 1/22 [>.............................] - ETA: 0s - loss: 103574.859410/22 [============>.................] - ETA: 0s - loss: 117007.460919/22 [========================>.....] - ETA: 0s - loss: 118858.195322/22 [==============================] - 0s 6ms/step - loss: 115600.0312
1/3 [=========>....................] - ETA: 0s - loss: 137395.09383/3 [==============================] - 0s 6ms/step - loss: 120136.0547
1/2 [==============>...............] - ETA: 0s - loss: 195771.75002/2 [==============================] - 0s 6ms/step - loss: 192468.8594
 1/22 [>.............................] - ETA: 0s - loss: 105850.140611/22 [==============>...............] - ETA: 0s - loss: 119129.726620/22 [==========================>...] - ETA: 0s - loss: 118245.039122/22 [==============================] - 0s 5ms/step - loss: 116378.4609
1/3 [=========>....................] - ETA: 0s - loss: 110515.62503/3 [==============================] - 0s 6ms/step - loss: 112791.5547
1/2 [==============>...............] - ETA: 0s - loss: 195888.26562/2 [==============================] - 0s 7ms/step - loss: 192608.7812
[1] "N layers at  8"
Model: "sequential_1"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 13)                      182         
                                                                                
 hidd_in_8 (Dense)                  (None, 8)                       112         
                                                                                
 latent (Dense)                     (None, 2)                       18          
                                                                                
 hidd_out_8 (Dense)                 (None, 8)                       24          
                                                                                
 output (Dense)                     (None, 13)                      117         
                                                                                
================================================================================
Total params: 453
Trainable params: 453
Non-trainable params: 0
________________________________________________________________________________
 1/22 [>.............................] - ETA: 0s - loss: 255631.7500 9/22 [===========>..................] - ETA: 0s - loss: 217485.031217/22 [======================>.......] - ETA: 0s - loss: 207162.500022/22 [==============================] - 0s 6ms/step - loss: 205058.9688
1/3 [=========>....................] - ETA: 0s - loss: 205561.96883/3 [==============================] - 0s 7ms/step - loss: 206310.2500
1/2 [==============>...............] - ETA: 0s - loss: 208932.12502/2 [==============================] - 0s 7ms/step - loss: 205301.9375
 1/22 [>.............................] - ETA: 0s - loss: 253493.7812 9/22 [===========>..................] - ETA: 0s - loss: 215943.609417/22 [======================>.......] - ETA: 0s - loss: 206540.593822/22 [==============================] - 0s 7ms/step - loss: 205168.9688
1/3 [=========>....................] - ETA: 0s - loss: 216799.18753/3 [==============================] - 0s 7ms/step - loss: 205134.6406
1/2 [==============>...............] - ETA: 0s - loss: 208807.29692/2 [==============================] - 0s 7ms/step - loss: 205223.2188
 1/22 [>.............................] - ETA: 0s - loss: 248454.9531 9/22 [===========>..................] - ETA: 0s - loss: 215932.828117/22 [======================>.......] - ETA: 0s - loss: 206637.093822/22 [==============================] - 0s 6ms/step - loss: 205237.4219
1/3 [=========>....................] - ETA: 0s - loss: 219982.21883/3 [==============================] - 0s 6ms/step - loss: 204562.0469
1/2 [==============>...............] - ETA: 0s - loss: 208535.92192/2 [==============================] - 0s 7ms/step - loss: 205002.4844
 1/22 [>.............................] - ETA: 0s - loss: 250315.8750 9/22 [===========>..................] - ETA: 0s - loss: 216614.218817/22 [======================>.......] - ETA: 0s - loss: 206786.062522/22 [==============================] - 0s 7ms/step - loss: 205553.8594
1/3 [=========>....................] - ETA: 0s - loss: 213911.93753/3 [==============================] - 0s 6ms/step - loss: 201369.7500
1/2 [==============>...............] - ETA: 0s - loss: 209206.93752/2 [==============================] - 0s 8ms/step - loss: 205529.1406
 1/22 [>.............................] - ETA: 0s - loss: 252163.8750 9/22 [===========>..................] - ETA: 0s - loss: 215402.640617/22 [======================>.......] - ETA: 0s - loss: 205843.609422/22 [==============================] - 0s 6ms/step - loss: 204252.0156
1/3 [=========>....................] - ETA: 0s - loss: 224641.25003/3 [==============================] - 0s 8ms/step - loss: 212678.2031
1/2 [==============>...............] - ETA: 0s - loss: 209225.09382/2 [==============================] - 0s 7ms/step - loss: 205563.0938
 1/22 [>.............................] - ETA: 0s - loss: 250852.5000 9/22 [===========>..................] - ETA: 0s - loss: 216353.828117/22 [======================>.......] - ETA: 0s - loss: 206614.531222/22 [==============================] - 0s 7ms/step - loss: 204908.5781
1/3 [=========>....................] - ETA: 0s - loss: 215221.92193/3 [==============================] - 0s 6ms/step - loss: 206433.4844
1/2 [==============>...............] - ETA: 0s - loss: 209147.53122/2 [==============================] - 0s 8ms/step - loss: 205512.7812
 1/22 [>.............................] - ETA: 0s - loss: 253279.3281 9/22 [===========>..................] - ETA: 0s - loss: 215300.890617/22 [======================>.......] - ETA: 0s - loss: 206514.046922/22 [==============================] - 0s 6ms/step - loss: 204978.3125
1/3 [=========>....................] - ETA: 0s - loss: 223955.87503/3 [==============================] - 0s 6ms/step - loss: 205565.8750
1/2 [==============>...............] - ETA: 0s - loss: 208506.98442/2 [==============================] - 0s 6ms/step - loss: 204959.7188
 1/22 [>.............................] - ETA: 0s - loss: 252156.4531 9/22 [===========>..................] - ETA: 0s - loss: 216193.031217/22 [======================>.......] - ETA: 0s - loss: 206780.765622/22 [==============================] - 0s 6ms/step - loss: 205031.3750
1/3 [=========>....................] - ETA: 0s - loss: 213857.34383/3 [==============================] - 0s 7ms/step - loss: 204682.3125
1/2 [==============>...............] - ETA: 0s - loss: 208941.51562/2 [==============================] - 0s 8ms/step - loss: 205324.5938
 1/22 [>.............................] - ETA: 0s - loss: 253579.4844 9/22 [===========>..................] - ETA: 0s - loss: 216095.796917/22 [======================>.......] - ETA: 0s - loss: 206758.609422/22 [==============================] - 0s 6ms/step - loss: 205092.1250
1/3 [=========>....................] - ETA: 0s - loss: 218838.53123/3 [==============================] - 0s 7ms/step - loss: 203762.0625
1/2 [==============>...............] - ETA: 0s - loss: 208775.84382/2 [==============================] - 0s 8ms/step - loss: 205199.7812
 1/22 [>.............................] - ETA: 0s - loss: 253087.9844 9/22 [===========>..................] - ETA: 0s - loss: 216443.890618/22 [=======================>......] - ETA: 0s - loss: 207127.234422/22 [==============================] - 0s 6ms/step - loss: 205453.8281
1/3 [=========>....................] - ETA: 0s - loss: 212449.54693/3 [==============================] - 0s 6ms/step - loss: 200268.0156
1/2 [==============>...............] - ETA: 0s - loss: 208664.17192/2 [==============================] - 0s 6ms/step - loss: 205121.4062
[1] "N layers at  4"
Model: "sequential_2"
________________________________________________________________________________
 Layer (type)                       Output Shape                    Param #     
================================================================================
 input (Dense)                      (None, 13)                      182         
                                                                                
 hidd_in_8 (Dense)                  (None, 8)                       112         
                                                                                
 hidd_in_4 (Dense)                  (None, 4)                       36          
                                                                                
 latent (Dense)                     (None, 2)                       10          
                                                                                
 hidd_out_4 (Dense)                 (None, 4)                       12          
                                                                                
 hidd_out_8 (Dense)                 (None, 8)                       40          
                                                                                
 output (Dense)                     (None, 13)                      117         
                                                                                
================================================================================
Total params: 509
Trainable params: 509
Non-trainable params: 0
________________________________________________________________________________
 1/22 [>.............................] - ETA: 0s - loss: 390354.5000 8/22 [=========>....................] - ETA: 0s - loss: 405465.250016/22 [====================>.........] - ETA: 0s - loss: 373675.000022/22 [==============================] - 0s 7ms/step - loss: 377315.0000
1/3 [=========>....................] - ETA: 0s - loss: 379811.18753/3 [==============================] - 0s 7ms/step - loss: 382381.8438
1/2 [==============>...............] - ETA: 0s - loss: 500734.43752/2 [==============================] - 0s 8ms/step - loss: 505253.0938
 1/22 [>.............................] - ETA: 0s - loss: 378414.0625 9/22 [===========>..................] - ETA: 0s - loss: 391619.843817/22 [======================>.......] - ETA: 0s - loss: 369976.281222/22 [==============================] - 0s 7ms/step - loss: 377696.6875
1/3 [=========>....................] - ETA: 0s - loss: 392997.56253/3 [==============================] - 0s 7ms/step - loss: 379020.3438
1/2 [==============>...............] - ETA: 0s - loss: 500459.68752/2 [==============================] - 0s 7ms/step - loss: 505012.9062
 1/22 [>.............................] - ETA: 0s - loss: 390476.6250 9/22 [===========>..................] - ETA: 0s - loss: 394841.218817/22 [======================>.......] - ETA: 0s - loss: 372390.218822/22 [==============================] - 0s 7ms/step - loss: 379031.8125
1/3 [=========>....................] - ETA: 0s - loss: 369509.87503/3 [==============================] - 0s 8ms/step - loss: 366335.1562
1/2 [==============>...............] - ETA: 0s - loss: 500543.75002/2 [==============================] - 0s 7ms/step - loss: 505093.5312
 1/22 [>.............................] - ETA: 0s - loss: 313007.6562 8/22 [=========>....................] - ETA: 0s - loss: 299509.500015/22 [===================>..........] - ETA: 0s - loss: 287994.468822/22 [==============================] - ETA: 0s - loss: 288391.968822/22 [==============================] - 0s 7ms/step - loss: 288391.9688
1/3 [=========>....................] - ETA: 0s - loss: 281565.62503/3 [==============================] - 0s 7ms/step - loss: 277341.2812
1/2 [==============>...............] - ETA: 0s - loss: 345824.81252/2 [==============================] - 0s 8ms/step - loss: 350074.1875
 1/22 [>.............................] - ETA: 0s - loss: 315896.2812 8/22 [=========>....................] - ETA: 0s - loss: 297429.250015/22 [===================>..........] - ETA: 0s - loss: 286830.156222/22 [==============================] - ETA: 0s - loss: 286810.031222/22 [==============================] - 0s 7ms/step - loss: 286810.0312
1/3 [=========>....................] - ETA: 0s - loss: 300126.25003/3 [==============================] - 0s 7ms/step - loss: 290395.5938
1/2 [==============>...............] - ETA: 0s - loss: 345876.00002/2 [==============================] - 0s 8ms/step - loss: 350135.5938
 1/22 [>.............................] - ETA: 0s - loss: 310136.5312 9/22 [===========>..................] - ETA: 0s - loss: 291476.375017/22 [======================>.......] - ETA: 0s - loss: 283174.750022/22 [==============================] - 0s 7ms/step - loss: 285738.1250
1/3 [=========>....................] - ETA: 0s - loss: 301281.50003/3 [==============================] - 0s 7ms/step - loss: 296041.2188
1/2 [==============>...............] - ETA: 0s - loss: 345276.40622/2 [==============================] - 0s 8ms/step - loss: 349592.0938
 1/22 [>.............................] - ETA: 0s - loss: 311013.8750 8/22 [=========>....................] - ETA: 0s - loss: 296614.343815/22 [===================>..........] - ETA: 0s - loss: 285890.093822/22 [==============================] - ETA: 0s - loss: 286058.750022/22 [==============================] - 0s 7ms/step - loss: 286058.7500
1/3 [=========>....................] - ETA: 0s - loss: 299958.56253/3 [==============================] - 0s 7ms/step - loss: 285564.1875
1/2 [==============>...............] - ETA: 0s - loss: 344363.53122/2 [==============================] - 0s 7ms/step - loss: 348727.7188
 1/22 [>.............................] - ETA: 0s - loss: 312854.1875 8/22 [=========>....................] - ETA: 0s - loss: 297298.375015/22 [===================>..........] - ETA: 0s - loss: 285867.218822/22 [==============================] - ETA: 0s - loss: 285670.156222/22 [==============================] - 0s 7ms/step - loss: 285670.1562
1/3 [=========>....................] - ETA: 0s - loss: 291048.31253/3 [==============================] - 0s 7ms/step - loss: 286905.2500
1/2 [==============>...............] - ETA: 0s - loss: 344340.00002/2 [==============================] - 0s 7ms/step - loss: 348609.5000
 1/22 [>.............................] - ETA: 0s - loss: 316625.8125 9/22 [===========>..................] - ETA: 0s - loss: 290546.062517/22 [======================>.......] - ETA: 0s - loss: 282426.812522/22 [==============================] - 0s 7ms/step - loss: 285243.0938
1/3 [=========>....................] - ETA: 0s - loss: 307982.84383/3 [==============================] - 0s 7ms/step - loss: 291115.3125
1/2 [==============>...............] - ETA: 0s - loss: 344040.06252/2 [==============================] - 0s 8ms/step - loss: 348364.5625
 1/22 [>.............................] - ETA: 0s - loss: 315216.4062 9/22 [===========>..................] - ETA: 0s - loss: 293201.093817/22 [======================>.......] - ETA: 0s - loss: 283500.718822/22 [==============================] - 0s 7ms/step - loss: 286780.2500
1/3 [=========>....................] - ETA: 0s - loss: 280354.78123/3 [==============================] - 0s 7ms/step - loss: 276660.3438
1/2 [==============>...............] - ETA: 0s - loss: 344357.31252/2 [==============================] - 0s 7ms/step - loss: 348651.6562
Autoencoder optimization: 2940.631 sec elapsed
git add *.RData
git commit -m "Updated results"
[exp_rem_rows fa217cb] Updated results
 Committer: Alba Gonzalez-Cebrian <alba@phi.cloudenci.ie>
Your name and email address were configured automatically based
on your username and hostname. Please check that they are accurate.
You can suppress this message by setting them explicitly:

    git config --global user.name "Your Name"
    git config --global user.email you@example.com

After doing this, you may fix the identity used for this commit with:

    git commit --amend --reset-author

 1 file changed, 0 insertions(+), 0 deletions(-)
 create mode 100644 AQ_optAElayers.RData
git pull
Already up to date.
git push
To https://github.com/SMARDY-NCI/ADV.git
   3e360e7..fa217cb  exp_rem_rows -> exp_rem_rows
